In [2]:
import pandas as pd

In [3]:

data = [{'name': 'John', 'age': 30, 'city': 'Taipei'},
        {'name': 'Mary', 'age': 25, 'city': 'Taichung'},
        {'name': 'Ken', 'age': 35, 'city': 'Kaohsiung'}]
df = pd.DataFrame(data)
df

   name  age       city
0  John   30     Taipei
1  Mary   25   Taichung
2   Ken   35  Kaohsiung

In [4]:
# 行
df['name']

0    John
1    Mary
2     Ken
Name: name, dtype: object

In [5]:
# 列
df.loc[0]

name      John
age         30
city    Taipei
Name: 0, dtype: object

In [13]:
df.loc[[0, 1]]
type(df.loc[[0]])

pandas.core.frame.DataFrame

In [7]:
df.at[0, 'name']

'John'

In [8]:
df[df['age'] >= 30]

   name  age       city
0  John   30     Taipei
2   Ken   35  Kaohsiung

In [9]:
# df.head(2)
df.tail(2)

   name  age       city
1  Mary   25   Taichung
2   Ken   35  Kaohsiung

In [10]:
df.loc[:, ]

   name  age       city
0  John   30     Taipei
1  Mary   25   Taichung
2   Ken   35  Kaohsiung

# DataFrame.items()

Iterate over (column name, Series) pairs

Yields:

+ label: object
    
    + The column names for the DataFrame being iterated over.

+ content: Series
    
    + The column entries belonging to each label, as a Series.

In [11]:
# 走訪 DataFrame
for col, values in df.items():
    print(f"{col}: ", end="")
    for v in values: 
        print(v, end=" ")
    print()

name: John Mary Ken
age: 30 25 35
city: Taipei Taichung Kaohsiung